src/cf/Documents/Shipment.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Shipment</Name>
			<BasedOn>
				<xr:Item>Document.CustomerOrder</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.DeliveryTimeCounter</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ShippingCarrier</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Carriers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Address</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeliveryTimePlan</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DestMap</Name>
					<Comment>picture of a map</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BasisDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>CustomerOrders</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>CustomerOrder</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/Shipment/Ext/ObjectModule.bsl
Procedure Filling(FillingData, FillingText, StandardProcessing)
	
	If TypeOf (FillingData) <> Type("DocumentRef.CustomerOrder") Then
		Return;
	EndIf;
	
	FillingStrategy = New Map;
	FillingStrategy[Type("DocumentRef.CustomerOrder")]		= "FillByCustomerOrder";
	
	ObjectFillingSB.FillDocument(ThisObject, FillingData, FillingStrategy);
	
	
EndProcedure

Procedure FillByCustomerOrder(FillingData) Export
	
	// Header filling.
	AttributeValues = CommonUse.GetAttributeValues(FillingData, 
			New Structure("Company, Counterparty"));
	
	FillPropertyValues(ThisObject, AttributeValues, "Company, Counterparty");
	ThisObject.BasisDocument = FillingData;
	
	// Tabular section "CustomerOrders" filling
	NewRow = CustomerOrders.Add();
	NewRow.CustomerOrder = FillingData;
		
EndProcedure


Procedure Posting(Cancel, PostingMode)
	
	// Initialization of additional properties for document posting.
	SmallBusinessServer.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);
	
	// Document data initialization.
	PerformanceEstimationClientServer.StartTimeMeasurement("ShipmentDocumentPostingInitialization");
	
	Documents.Shipment.InitializeDocumentData(Ref, AdditionalProperties);
	
	// Preparation of records sets.
	SmallBusinessServer.PrepareRecordSetsForRecording(ThisObject);
	
	// Account for in accounting sections.
	PerformanceEstimationClientServer.StartTimeMeasurement("SalesInvoiceDocumentPostingMovementsCreation");
	

	// DeliveryTime
	SmallBusinessServer.ReflectDeliveryTimeCounter(AdditionalProperties, RegisterRecords, Cancel);
	
	// Record of the records sets.
	PerformanceEstimationClientServer.StartTimeMeasurement("SalesInvoiceDocumentPostingMovementsRecords");
	
	SmallBusinessServer.WriteRecordSets(ThisObject);
	
	AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager.Close();
	

EndProcedure
